{
  "backend/main.mo": "Defines the backend actor with ordered maps and data models for journeys, locations, ratings, media, travel spots, albums, layouts, schedules, bookmarks, and geoname cities.",
  "feature_evidence.json": "Lists detected product features with associated files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend files to aid build and feature mapping.",
  "frontend/index.html": "HTML entry file that loads root app container and main TypeScript module.",
  "frontend/src/App.tsx": "Top‑level React app setup with theming, identity provider, query client, backend debugger, and main map explorer.",
  "frontend/src/components/AdminPanel.tsx": "Admin UI for managing journeys, schedules, travel spots, music albums, and geoname data with calendar popovers and CRUD workflows.",
  "frontend/src/components/BackendDebugger.tsx": "Exposes backend actor and debugging utilities to the browser console for development.",
  "frontend/src/components/CityAlbumManager.tsx": "Manages city albums including media uploads, validation, listing, and social media link handling.",
  "frontend/src/components/CityloguePanel.tsx": "Empty file with no implemented content.",
  "frontend/src/components/GeonameGeographicalManager.tsx": "Manages city data import, search, pagination, and CRUD operations with a form and file upload parsing for geonames data.",
  "frontend/src/components/HeartRating.tsx": "Interactive 10-heart rating component supporting partial fills, hover effects, and click-based fractional ratings.",
  "frontend/src/components/InteractiveGlobe.tsx": "Three.js-based globe visualization with overlays, labels, flight animations, timezone rendering, and extensive UI/animation controls.",
  "frontend/src/components/LocationInfoDialog.tsx": "Dialog for adding, updating, or deleting location photos with file validation, preview, and backend mutations.",
  "frontend/src/components/LoginPanel.tsx": "Authentication panel using Internet Identity with login/logout handling, status display, and modal UI.",
  "frontend/src/components/MapComponent.tsx": "Leaflet-based map showing travel spots, bookmarks, and media, with custom icons, popups, and multiple data queries.",
  "frontend/src/components/MediaGalleryPopup.tsx": "Displays photos, videos, and social media embeds in a tabbed gallery with YouTube/Instagram URL parsing utilities.",
  "frontend/src/components/MusicAlbumManager.tsx": "Provides an admin interface to create, edit, delete music albums and upload songs using backend queries and file upload hooks.",
  "frontend/src/components/MusicPanel.tsx": "Shows a dialog-based music collection browser allowing users to explore albums and select songs for playback.",
  "frontend/src/components/MusicPlayerBar.tsx": "Implements an audio player bar that handles playback, volume, progress, and song navigation using album data.",
  "frontend/src/components/TimezoneManagement.tsx": "Uploads, validates, stores, and verifies GeoJSON timezone data via backend actor and IndexedDB with manual execution steps.",
  "frontend/src/components/TraveloguePanel.tsx": "Displays journeys with expandable itineraries and lets users add, edit, and delete schedule items.",
  "frontend/src/components/TravelSpotManager.tsx": "UI to create, edit, list, and delete travel spots, including file uploads and social media links.",
  "frontend/src/components/VibesPanel.tsx": "Shows vibes grouped by city, merging bookmarks and travel spots with type-based icons and navigation callbacks.",
  "frontend/src/components/WebsiteLayoutPanel.tsx": "Panel for editing website layout preferences such as map settings, display options, and local time display.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, providing login, logout, identity loading, and context access.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks plus utilities for geocoding, country name normalization, and social media URL validation.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and extensive theme variables for light/dark modes and UI components.",
  "frontend/src/lib/solarCalculations.ts": "Offers solar declination calculation and includes console-based test cases for astronomical events.",
  "frontend/src/lib/timezoneOffsetUtils.ts": "Provides quarter‑hour‑precision timezone offset matching using Intl API on GeoJSON timezone data.",
  "frontend/src/lib/timezoneUtils.ts": "Handles loading, caching, and validation of timezone GeoJSON data using IndexedDB and backend fallback.",
  "frontend/src/lib/TzOverlayV2.ts": "Implements timezone boundary rendering on a 3D globe, including coordinate helpers and offset-based timezone filtering.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CountryMapExplorer.tsx": "Empty placeholder file for a Country Map Explorer page.",
  "frontend/src/pages/LocationMapExplorer.tsx": "Main map explorer page managing search, view modes (2D/3D), globe settings, travel spot focus, and music integration.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, writing, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, animations, layout, and plugin setup for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the requirement to add a non-functional 'Map' button next to 'Flying' in the Travelogue without altering existing layouts."
}