{
  "backend/main.mo": "Defines the backend actor with numerous ordered maps and rich domain types for journeys, locations, ratings, albums, schedules, bookmarks, and related data.",
  "feature_evidence.json": "Lists feature evidence for adding a no-op Map button in the Travelogue UI, mapping each feature to affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides short descriptions of many frontend files and their roles, including maps, hooks, panels, managers, and UI components.",
  "frontend/index.html": "Basic HTML bootstrap page loading the root React app and the SunCalc library.",
  "frontend/src/App.tsx": "Root React component configuring providers and rendering the LocationMapExplorer and BackendDebugger.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface handling journeys, schedules, and related forms with extensive UI controls and state management.",
  "frontend/src/components/BackendDebugger.tsx": "Exposes the backend canister actor to the browser console with debugging and admin-inspection utilities.",
  "frontend/src/components/CityAlbumManager.tsx": "Manages city albums with media upload, validation, social links, and album retrieval/modification logic.",
  "frontend/src/components/CityloguePanel.tsx": "Empty or placeholder file with no provided content.",
  "frontend/src/components/GeonameGeographicalManager.tsx": "Manages city import, search, pagination, and CRUD operations with a form and file upload for Geonames data.",
  "frontend/src/components/HeartRating.tsx": "Displays a 10-heart rating widget with hover, partial-fill logic, and click-to-rate interactions.",
  "frontend/src/components/InteractiveGlobe.tsx": "Renders a 3D interactive globe with cities, borders, labels, animations, and optional time zone or flight features.",
  "frontend/src/components/LocationInfoDialog.tsx": "Dialog for adding, updating, or deleting location photos with file validation and storage integration.",
  "frontend/src/components/LoginPanel.tsx": "Authentication panel using Internet Identity with status display, login/logout actions, and error handling.",
  "frontend/src/components/MapComponent.tsx": "Leaflet-based map showing travel spots, bookmarks, media, and schedule items with custom icons and popups.",
  "frontend/src/components/MediaGalleryPopup.tsx": "Displays photos, videos, and social media embeds in tabbed sections with utilities for parsing and embedding YouTube/Instagram links.",
  "frontend/src/components/MusicAlbumManager.tsx": "Provides UI for creating, editing, and deleting music albums and uploading songs with form dialogs and backend mutations.",
  "frontend/src/components/MusicPanel.tsx": "Shows a music collection dialog that lists albums and songs, allowing users to select tracks for playback.",
  "frontend/src/components/MusicPlayerBar.tsx": "Implements an audio player bar that plays songs, handles playback controls, and syncs with selected tracks.",
  "frontend/src/components/TimezoneManagement.tsx": "Allows uploading, validating, storing, and manually executing timezone GeoJSON data using backend and IndexedDB.",
  "frontend/src/components/TraveloguePanel.tsx": "Displays journeys and itineraries with collapsible schedules, editing tools, date formatting, and optional flight animations.",
  "frontend/src/components/TravelSpotManager.tsx": "UI for managing travel spots, including CRUD operations, media uploads, and social media links with city filtering and dialogs.",
  "frontend/src/components/VibesPanel.tsx": "Shows bookmarks and travel spots grouped by city and type, enhanced with spotType metadata and expandable sections.",
  "frontend/src/components/WebsiteLayoutPanel.tsx": "Interface for modifying website layout preferences such as map settings, search defaults, and music player visibility.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides geocoding, country-name normalization, social media URL validation, and React Query hooks for backend-related data.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for theming, including light/dark modes and music player color sets.",
  "frontend/src/lib/solarCalculations.ts": "Calculates solar declination and includes console-based test cases for verifying astronomical outputs.",
  "frontend/src/lib/timezoneOffsetUtils.ts": "Provides functions to compute timezone IDs for a given UTC offset using Intl API with quarter-hour precision.",
  "frontend/src/lib/timezoneUtils.ts": "Handles loading, caching, and validating timezone GeoJSON via IndexedDB and backend fallback.",
  "frontend/src/lib/TzOverlayV2.ts": "Implements timezone boundary rendering on a 3D globe with coordinate utilities, quarter-hour offset matching, and overlay group management.",
  "frontend/src/main.tsx": "Sets up the React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/CountryMapExplorer.tsx": "Placeholder file with no implemented content.",
  "frontend/src/pages/LocationMapExplorer.tsx": "Main map explorer page handling 2D/3D views, location search, globe options, travel spot focus, and music/layout integration.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project state metadata describing the placeholder Map button feature, requirements, and status."
}