{
  "backend/main.mo": "Defines the canister's data models, in-memory maps, and registry/access-control state for journeys, locations, user profiles, media, ratings, schedules, and map data.",
  "feature_evidence.json": "Contains structured feature evidence describing feature IDs, descriptions, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Lists concise summaries of various frontend source files, describing each component’s purpose and behavior.",
  "frontend/index.html": "Basic HTML entry point that loads the root element and bootstraps the React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level React component configuring theme, identity, query client, backend debugger, and rendering LocationMapExplorer.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface for managing journeys and schedule items with calendar popovers, forms, and CRUD operations.",
  "frontend/src/components/BackendDebugger.tsx": "Utility component exposing the backend actor to the browser console for debugging with role and admin inspection tools.",
  "frontend/src/components/CityAlbumManager.tsx": "Manages city albums including selecting cities, uploading media, validating files, and adding or removing social media links.",
  "frontend/src/components/CityloguePanel.tsx": "Empty file or placeholder with no implemented content.",
  "frontend/src/components/GeonameGeographicalManager.tsx": "Provides UI for importing, browsing, searching, and editing Geoname city records with pagination and file upload parsing.",
  "frontend/src/components/HeartRating.tsx": "Renders a 10-heart rating component with hover, partial fills, and click-based fractional rating selection.",
  "frontend/src/components/InteractiveGlobe.tsx": "Implements a 3D interactive globe with city markers, timezone overlays, animations, and extensive rendering logic using Three.js.",
  "frontend/src/components/LocationInfoDialog.tsx": "Dialog for adding, updating, or deleting location photos with file validation, previewing, and upload handling.",
  "frontend/src/components/LoginPanel.tsx": "Authentication panel for Internet Identity login/logout with status display and React Query cache handling.",
  "frontend/src/components/MapComponent.tsx": "Interactive Leaflet-based map showing travel spots, bookmarks, and schedule items with custom icons, popups, and media dialogs.",
  "frontend/src/components/MediaGalleryPopup.tsx": "Displays photos, videos, and social media embeds in tabbed sections with YouTube and Instagram parsing utilities.",
  "frontend/src/components/MusicAlbumManager.tsx": "Admin interface to create, edit, and delete music albums and upload songs with file handling and form dialogs.",
  "frontend/src/components/MusicPanel.tsx": "Music library panel that lists albums and songs, allowing users to browse and select tracks.",
  "frontend/src/components/MusicPlayerBar.tsx": "Bottom audio player bar handling playback, volume, progress, and song switching for the music collection.",
  "frontend/src/components/TimezoneManagement.tsx": "Provides UI to upload, validate, store, and manually execute syncing of timezone GeoJSON data with backend and IndexedDB.",
  "frontend/src/components/TraveloguePanel.tsx": "Displays journeys and schedules with filtering, editing, and date formatting, plus optional map and flight animation callbacks.",
  "frontend/src/components/TravelSpotManager.tsx": "Manages CRUD operations for travel spots, including media uploads, social links, filtering by city, and form dialogs.",
  "frontend/src/components/VibesPanel.tsx": "Shows bookmarks and travel spots grouped by city with type-based icons and expansion controls, enabling focus callbacks.",
  "frontend/src/components/WebsiteLayoutPanel.tsx": "Lets users configure layout preferences such as map settings and display options, saving updates via backend mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling AuthClient setup, identity loading, login, and logout state.",
  "frontend/src/hooks/useQueries.ts": "Defines data-fetching hooks and utilities including geocoding, country normalization, and social media URL validation using React Query and backend actors.",
  "frontend/src/index.css": "Sets up Tailwind layers and declares extensive CSS variables for themes, colors, and layout styling for both light and dark modes.",
  "frontend/src/lib/solarCalculations.ts": "Provides solar declination calculation utilities and test cases for validating astronomical computations.",
  "frontend/src/lib/timezoneOffsetUtils.ts": "Utility functions to compute timezone IDs matching a given UTC offset using Intl-based quarter‑hour precision.",
  "frontend/src/lib/timezoneUtils.ts": "Utilities for loading, caching, validating, and retrieving timezone GeoJSON data using IndexedDB and backend fetches.",
  "frontend/src/lib/TzOverlayV2.ts": "Implements timezone overlay rendering on a 3D globe, including geometry processing, vector conversion, and quarter‑hour offset matching.",
  "frontend/src/main.tsx": "Initializes React app root with Internet Identity and React Query providers.",
  "frontend/src/pages/CountryMapExplorer.tsx": "Empty page placeholder for a country map explorer.",
  "frontend/src/pages/LocationMapExplorer.tsx": "Main interactive map page handling search, 2D/3D modes, layers, panels, music, and travel-related selections.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing map‑related feature requirements and current app state."
}