{
  "backend/main.mo": "Defines the backend actor with ordered maps and types for journeys, locations, media, user profiles, bookmarks, and geoname city data.",
  "feature_evidence.json": "Feature evidence report listing implemented UI feature requirements, related files, components, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-like document providing short descriptions of various frontend files and their functionality.",
  "frontend/index.html": "Root HTML file that loads the app entrypoint and includes the SunCalc library.",
  "frontend/src/App.tsx": "Sets up providers and renders the backend debugger and main LocationMapExplorer component.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface for managing journeys, schedules, and related data with calendar and form controls.",
  "frontend/src/components/BackendDebugger.tsx": "Development utility that exposes the backend actor and principal info to the browser console for debugging.",
  "frontend/src/components/CityAlbumManager.tsx": "Manages city albums with media uploads, social media link handling, and city selection logic using various backend hooks.",
  "frontend/src/components/CityloguePanel.tsx": "Empty or missing component content.",
  "frontend/src/components/GeonameGeographicalManager.tsx": "Provides UI for importing, browsing, searching, and CRUD operations on Geoname city data with file parsing support.",
  "frontend/src/components/HeartRating.tsx": "Displays a 10-heart rating widget with hover effects, partial fills, and click-based rating selection.",
  "frontend/src/components/InteractiveGlobe.tsx": "Renders an interactive 3D globe with timezone overlays, city labels, animations, and customizable visual layers.",
  "frontend/src/components/LocationInfoDialog.tsx": "Dialog for uploading, updating, or deleting location photos with validation and backend integration.",
  "frontend/src/components/LoginPanel.tsx": "Login/logout panel using Internet Identity with status display, error handling, and session management.",
  "frontend/src/components/MapComponent.tsx": "Large Leaflet-based map component that loads travel spots, bookmarks, and schedule markers, renders custom icons, and manages media popups and interactions.",
  "frontend/src/components/MediaGalleryPopup.tsx": "Displays photos, videos, and social media embeds in tabbed gallery format, including YouTube and Instagram embed support.",
  "frontend/src/components/MusicAlbumManager.tsx": "Admin interface for creating, editing, and deleting music albums and songs, including file uploads and form dialogs.",
  "frontend/src/components/MusicPanel.tsx": "Dialog-based music browser listing all albums and songs, allowing users to select a track for playback.",
  "frontend/src/components/MusicPlayerBar.tsx": "Audio player bar that loads songs, handles playback controls, volume, progress, and responds to selection from the music panel.",
  "frontend/src/components/TimezoneManagement.tsx": "Handles uploading, validating, storing, and manually executing GeoJSON timezone data using backend and IndexedDB.",
  "frontend/src/components/TraveloguePanel.tsx": "Displays journeys and schedules with filtering, editing, and itinerary rendering options.",
  "frontend/src/components/TravelSpotManager.tsx": "Provides a UI to create, edit, delete, and manage travel spots with media uploads and social media links.",
  "frontend/src/components/VibesPanel.tsx": "Shows bookmarked and travel spot vibes grouped by city with type-based icons and interaction callbacks.",
  "frontend/src/components/WebsiteLayoutPanel.tsx": "Allows users to configure website layout settings including map options and display preferences.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for managing Internet Identity authentication, loading stored identities, and handling login state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks and utilities for backend data access, location geocoding, and social media URL validation.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light/dark themes, fonts, and themed itinerary styles.",
  "frontend/src/lib/solarCalculations.ts": "Functions for computing solar declination by day of year plus basic console test cases.",
  "frontend/src/lib/timezoneOffsetUtils.ts": "Helper to list timezone IDs matching a given UTC offset using quarter‑hour rounding and DST-aware calculations.",
  "frontend/src/lib/timezoneUtils.ts": "Utilities for loading, validating, and caching timezone GeoJSON data using IndexedDB and backend fetches.",
  "frontend/src/lib/TzOverlayV2.ts": "Utilities for rendering timezone boundaries on a 3D globe, including coordinate conversion, geometry cleanup, and offset-based timezone lookup.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider.",
  "frontend/src/pages/CountryMapExplorer.tsx": "Placeholder file for a country map explorer page with no implemented content.",
  "frontend/src/pages/LocationMapExplorer.tsx": "Implements a feature-rich 2D/3D map explorer with search, globe interactions, travel spots, bookmarks, music, and timezone display options.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, animations, plugins, and layout settings.",
  "project_state.json": "Project state metadata describing itinerary UI features, known issues, and pending feature requests."
}