{
  "backend/main.mo": "Defines the canister’s core data models and in‑memory OrderedMap storage for journeys, locations, albums, travel spots, user profiles, ratings, bookmarks, and related types.",
  "feature_evidence.json": "Feature evidence report describing a UI update requirement and the file affected by the change.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files and their roles in the application.",
  "frontend/index.html": "Base HTML file that loads the main React entry point and includes the SunCalc script.",
  "frontend/src/App.tsx": "App root that sets up theme, identity, React Query, backend debugging, and renders the LocationMapExplorer.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface for managing journeys, schedules, travel spots, music albums, and geoname data with calendar popovers and CRUD operations.",
  "frontend/src/components/BackendDebugger.tsx": "Dev tool that exposes the backend actor to the browser console and logs admin‑related debug information.",
  "frontend/src/components/CityAlbumManager.tsx": "Manages city albums with media upload, validation, social media links, and album selection features.",
  "frontend/src/components/CityloguePanel.tsx": "File is present but contains no content.",
  "frontend/src/components/GeonameGeographicalManager.tsx": "Manages importing, browsing, searching, and CRUD operations for Geoname city data with file parsing and form dialogs.",
  "frontend/src/components/HeartRating.tsx": "Renders a 10-heart rating widget with hover, partial fill, and click-based fractional ratings.",
  "frontend/src/components/InteractiveGlobe.tsx": "Displays an interactive Three.js globe with city markers, time zones, animations, and extensive rendering controls.",
  "frontend/src/components/LocationInfoDialog.tsx": "Dialog for adding, updating, or deleting location info with image upload, preview, and validation.",
  "frontend/src/components/LoginPanel.tsx": "Authentication panel using Internet Identity with login/logout, status display, and error handling.",
  "frontend/src/components/MapComponent.tsx": "Leaflet-based map showing travel spots, media, bookmarks, and interactions like zoom, markers, and popups.",
  "frontend/src/components/MediaGalleryPopup.tsx": "Displays photos, videos, and social media embeds in a tabbed gallery with YouTube and Instagram URL parsing.",
  "frontend/src/components/MusicAlbumManager.tsx": "Admin interface for creating, editing, and deleting music albums and songs, including file uploads.",
  "frontend/src/components/MusicPanel.tsx": "Shows music albums and songs in a dialog, allowing users to browse and select tracks for playback.",
  "frontend/src/components/MusicPlayerBar.tsx": "Audio player bar that handles song playback, progress, volume, and navigation across all albums.",
  "frontend/src/components/TimezoneManagement.tsx": "Tool for uploading, validating, storing, and manually executing GeoJSON timezone data updates.",
  "frontend/src/components/TraveloguePanel.tsx": "Panel displaying journeys and itineraries with filtering, editing, and date formatting utilities.",
  "frontend/src/components/TravelSpotManager.tsx": "UI for managing travel spots with create, edit, delete, media upload, and social media link features.",
  "frontend/src/components/VibesPanel.tsx": "Displays bookmarks and travel spots grouped by city and type, with enhanced item metadata and focus callbacks.",
  "frontend/src/components/WebsiteLayoutPanel.tsx": "Panel for configuring website layout settings like map options and display preferences.",
  "frontend/src/hooks/useActor.ts": "React hook creating and updating a backend actor based on Internet Identity and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks plus helpers for geocoding, social media URL validation, and country-name normalization.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light/dark themes and UI color customization.",
  "frontend/src/lib/solarCalculations.ts": "Contains solar declination calculation utilities and a console test suite for verifying astronomical values.",
  "frontend/src/lib/timezoneOffsetUtils.ts": "Provides functions to compute and filter timezone IDs by UTC offset using Intl-based quarter-hour precision.",
  "frontend/src/lib/timezoneUtils.ts": "Manages loading, caching, and validating timezone GeoJSON data using IndexedDB and backend fallback.",
  "frontend/src/lib/TzOverlayV2.ts": "Implements 3D globe timezone overlay rendering, including coordinate conversion, polygon cleanup, and offset-based TZ filtering.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers before rendering App.",
  "frontend/src/pages/CountryMapExplorer.tsx": "Empty or placeholder file for a country map explorer page.",
  "frontend/src/pages/LocationMapExplorer.tsx": "Main interactive map page handling search, 2D/3D map modes, globe options, travel spot focus, music controls, and UI panels.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, writing, and clearing URL and session-stored parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, animations, layout settings, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata describing an in-progress feature to enhance selected itinerary day labels with date and weekday displays."
}