{
  "backend/main.mo": "Defines the backend actor with maps for journeys, locations, users, ratings, media, schedules, bookmarks, and cities, along with all related data types.",
  "feature_evidence.json": "Lists feature evidence entries mapping requested UI changes to affected frontend files with metadata and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of various frontend files describing their purpose and recent enhancements.",
  "frontend/index.html": "Basic HTML entry point that loads the React app and includes the suncalc script.",
  "frontend/src/App.tsx": "Sets up providers and renders the main LocationMapExplorer along with the BackendDebugger and global toaster.",
  "frontend/src/components/AdminPanel.tsx": "Implements an admin panel for managing journeys and schedules with calendar popovers, forms, and CRUD operations.",
  "frontend/src/components/BackendDebugger.tsx": "Exposes the backend actor to the browser console for debugging, showing principal info and temporary admin utilities.",
  "frontend/src/components/CityAlbumManager.tsx": "Manages city albums with media uploads, social links, validation, and integration with backend queries and file storage.",
  "frontend/src/components/CityloguePanel.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/GeonameGeographicalManager.tsx": "Provides UI to import, browse, search, create, update, and delete Geoname city records with pagination and file parsing.",
  "frontend/src/components/HeartRating.tsx": "Interactive 10-heart rating component supporting partial fills, hover effects, and optional read-only mode.",
  "frontend/src/components/InteractiveGlobe.tsx": "Large 3D globe component using Three.js with layers, labels, animations, timezone overlays, and flight path visualization.",
  "frontend/src/components/LocationInfoDialog.tsx": "Dialog for uploading, previewing, saving, updating, or deleting a photo tied to a specific location's metadata.",
  "frontend/src/components/LoginPanel.tsx": "Authentication panel handling login/logout with Internet Identity, status display, and UI dialog interactions.",
  "frontend/src/components/MapComponent.tsx": "Interactive Leaflet-based map component that loads markers for travel spots, bookmarks, and schedule items with custom icons and popups.",
  "frontend/src/components/MediaGalleryPopup.tsx": "Displays photos, videos, and social media embeds in tabbed gallery with utilities for parsing YouTube and Instagram links.",
  "frontend/src/components/MusicAlbumManager.tsx": "Admin interface for creating, editing, and deleting music albums and songs with file upload support.",
  "frontend/src/components/MusicPanel.tsx": "Dialog-based UI for browsing music albums and selecting songs, showing albums, songs, and playback status.",
  "frontend/src/components/MusicPlayerBar.tsx": "Audio player bar that plays songs from albums, handles playback controls, volume, and integration with user preferences.",
  "frontend/src/components/TimezoneManagement.tsx": "Provides UI to upload, validate, store, and manually execute syncing of timezone GeoJSON data using backend and IndexedDB.",
  "frontend/src/components/TraveloguePanel.tsx": "Displays journeys and itineraries with collapsible schedules, editing tools, filtering, and optional flight animation callbacks.",
  "frontend/src/components/TravelSpotManager.tsx": "Manages creation, editing, deletion, media uploads, and social links for travel spots with city filtering and dialogs.",
  "frontend/src/components/VibesPanel.tsx": "Shows combined travel spots and bookmarks grouped by city and type, with expandable sections and item-type icons.",
  "frontend/src/components/WebsiteLayoutPanel.tsx": "Provides a dialog for editing website layout preferences such as map settings, display options, and music player toggle.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks and utilities for backend interactions, including geocoding, country name normalization, and social media URL validation.",
  "frontend/src/index.css": "Tailwind-based global styles defining CSS variables, light/dark themes, and specific heading and layout rules.",
  "frontend/src/lib/solarCalculations.ts": "Provides a function to compute solar declination by day of year and includes console-based test cases.",
  "frontend/src/lib/timezoneOffsetUtils.ts": "Utility for retrieving timezone IDs matching a given UTC offset using Intl-based DST-aware calculations.",
  "frontend/src/lib/timezoneUtils.ts": "Provides utilities for loading, caching, and validating timezone GeoJSON data using IndexedDB and optional backend fetching.",
  "frontend/src/lib/TzOverlayV2.ts": "Implements timezone overlay rendering on a 3D globe with quarter-hour offset handling and geometry utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CountryMapExplorer.tsx": "Empty placeholder page component with no implemented logic.",
  "frontend/src/pages/LocationMapExplorer.tsx": "Implements an interactive 2D/3D map explorer with search, panels, overlays, and various UI controls.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining themes, colors, animations, and plugin usage.",
  "project_state.json": "Project metadata describing features, requirements, and issue tracking state."
}