{
  "backend/main.mo": "Defines backend actor with numerous ordered maps and types for journeys, locations, media, ratings, schedules, bookmarks, and geoname data.",
  "feature_evidence.json": "Lists feature evidence entries mapping requested features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files describing their functionality and recent enhancements.",
  "frontend/index.html": "Basic HTML entry point that loads root container and main.tsx with SunCalc script.",
  "frontend/src/App.tsx": "Top-level React app that sets up theming, identity, query client, backend debugger, and renders LocationMapExplorer.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel with journey and schedule management, calendar-based date selection, and nested editors for related resources.",
  "frontend/src/components/BackendDebugger.tsx": "Utility component exposing backend actor and admin tools to the browser console for debugging.",
  "frontend/src/components/CityAlbumManager.tsx": "UI for managing city albums with media uploads, social links, validation, and album selection.",
  "frontend/src/components/CityloguePanel.tsx": "Empty or placeholder file with no implemented content.",
  "frontend/src/components/GeonameGeographicalManager.tsx": "UI for importing, searching, paginating, adding, editing, and deleting Geoname city records with file parsing and classification logic.",
  "frontend/src/components/HeartRating.tsx": "Interactive 10-heart rating component supporting partial fills, hover, clicks, and readonly mode.",
  "frontend/src/components/InteractiveGlobe.tsx": "3D globe component with time zones, labels, markers, solar/terminator rendering, flight animation, and complex Three.js scene management.",
  "frontend/src/components/LocationInfoDialog.tsx": "Dialog for uploading, previewing, saving, and deleting location photos with file validation and backend mutations.",
  "frontend/src/components/LoginPanel.tsx": "Authentication panel using Internet Identity with status display, login/logout handling, and error feedback.",
  "frontend/src/components/MapComponent.tsx": "Leaflet-based map with markers, travel spots, media popups, bookmarks, and UI for interacting with mapped entities.",
  "frontend/src/components/MediaGalleryPopup.tsx": "Renders a tabbed media gallery with photos, videos, and social media embeds, including utilities for parsing YouTube and Instagram URLs.",
  "frontend/src/components/MusicAlbumManager.tsx": "Provides UI and logic for creating, editing, and deleting music albums and songs, including file uploads and form dialogs.",
  "frontend/src/components/MusicPanel.tsx": "Displays music albums and their songs in a dialog, allowing selection of songs and showing authentication or empty states.",
  "frontend/src/components/MusicPlayerBar.tsx": "Implements a bottom music player bar with playback controls, progress tracking, volume handling, and automatic song navigation.",
  "frontend/src/components/TimezoneManagement.tsx": "Allows uploading, validating, storing, and executing timezone GeoJSON data with backend and IndexedDB integration.",
  "frontend/src/components/TraveloguePanel.tsx": "Displays journeys with expandable itineraries, schedule editing, filtering, and optional map or flight animations.",
  "frontend/src/components/TravelSpotManager.tsx": "UI for listing, filtering, creating, editing, and deleting travel spots, including media uploads and social media link management.",
  "frontend/src/components/VibesPanel.tsx": "Shows bookmarked places and travel spots grouped by city and type, with icons and focus callbacks.",
  "frontend/src/components/WebsiteLayoutPanel.tsx": "Panel to view and modify website layout settings such as map settings, display options, and defaults.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and login/logout via Internet Identity, persisting identities and managing AuthClient behavior.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks plus utilities for location search, country-name normalization, social media URL validation, and geocoding via Nominatim.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light/dark themes, layout, and heading color overrides.",
  "frontend/src/lib/solarCalculations.ts": "Contains a solar declination calculator and console-based test suite for key astronomical dates.",
  "frontend/src/lib/timezoneOffsetUtils.ts": "Provides utilities to compute timezone IDs matching a UTC offset using DST-aware Intl API and quarter‑hour rounding.",
  "frontend/src/lib/timezoneUtils.ts": "Handles loading, caching, validating, and fetching timezone GeoJSON using IndexedDB and backend fallback.",
  "frontend/src/lib/TzOverlayV2.ts": "Implements 3D globe timezone overlay rendering, including coordinate conversion, geometry cleanup, and timezone filtering by quarter‑hour offsets.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity, and renders the main App component.",
  "frontend/src/pages/CountryMapExplorer.tsx": "Empty placeholder file for a Country Map Explorer page.",
  "frontend/src/pages/LocationMapExplorer.tsx": "Main map explorer page managing 2D/3D map modes, search, globe settings, travel spots, bookmarks, music, and schedule item highlights.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing feature requirements for adding a Travelogue Map button and linking it to the 2D map with schedule items."
}