{
  "backend/main.mo": "Defines main backend actor with ordered maps and type models for journeys, locations, users, media, schedules, bookmarks, geoname cities, and layout settings.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, impacted files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend source files describing their roles and recent updates.",
  "frontend/index.html": "Base HTML entry point that loads the main React script and includes suncalc library.",
  "frontend/src/App.tsx": "Root React component configuring providers, query client, Internet Identity, and rendering LocationMapExplorer with BackendDebugger.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component handling journey and schedule CRUD, date‑range calendar popover, and accordion‑based management UI.",
  "frontend/src/components/BackendDebugger.tsx": "Utility component exposing the backend actor to window.console with role checks and temporary admin utilities.",
  "frontend/src/components/CityAlbumManager.tsx": "Manages city albums with media uploads, social media links, validation, and integration with identity and backend queries.",
  "frontend/src/components/CityloguePanel.tsx": "Empty file placeholder with no implementation.",
  "frontend/src/components/GeonameGeographicalManager.tsx": "Provides UI to import, search, paginate, add, edit, and delete Geoname city records, including file parsing and classification logic.",
  "frontend/src/components/HeartRating.tsx": "Interactive 10-heart rating component supporting partial fills, hover effects, and click-based fine‑grained rating selection.",
  "frontend/src/components/InteractiveGlobe.tsx": "Large 3D globe component handling rendering, overlays, city markers, time zones, animations, and interaction via Three.js.",
  "frontend/src/components/LocationInfoDialog.tsx": "Dialog for adding, updating, or deleting location info with image upload, preview, and backend integration.",
  "frontend/src/components/LoginPanel.tsx": "Authentication panel using Internet Identity with login/logout handling, status display, and UI dialog controls.",
  "frontend/src/components/MapComponent.tsx": "Interactive Leaflet-based map component that loads travel spots, schedule items, and bookmarks, rendering markers with custom icons and popups.",
  "frontend/src/components/MediaGalleryPopup.tsx": "Displays media files and social media embeds in a tabbed gallery, separating photos, videos, and external links.",
  "frontend/src/components/MusicAlbumManager.tsx": "Admin UI for creating, editing, and deleting music albums and songs, including file uploads and metadata management.",
  "frontend/src/components/MusicPanel.tsx": "Popup panel showing music albums and songs, allowing selection of tracks and integrating with authentication state.",
  "frontend/src/components/MusicPlayerBar.tsx": "Audio player bar that plays songs from all albums, handling playback state, progression, volume, and external song selection.",
  "frontend/src/components/TimezoneManagement.tsx": "Uploads, validates, stores, and manually executes GeoJSON timezone data using backend actor and IndexedDB.",
  "frontend/src/components/TraveloguePanel.tsx": "Displays journeys with collapsible itineraries, editing of schedule items, filtering, and optional flight animation via geocoding.",
  "frontend/src/components/TravelSpotManager.tsx": "Provides full CRUD for travel spots with media uploads, social links, filtering by city, and a form-driven dialog UI.",
  "frontend/src/components/VibesPanel.tsx": "Shows categorized bookmarks and travel spots by city with enhanced type metadata and expandable sections.",
  "frontend/src/components/WebsiteLayoutPanel.tsx": "Manages layout preferences such as music player toggle and default search place through a settings dialog.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication using AuthClient, handling login states and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Wraps react-query with backend actor calls and utilities like country normalization, social URL validation, and geocoding.",
  "frontend/src/hooks/useRowWrapBreaks.ts": "Detects row breaks in a wrapped flex container by tracking item positions and returns indices for rendering connectors.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers, theme variables for light/dark modes, and styling rules for headings and layout.",
  "frontend/src/lib/solarCalculations.ts": "Provides solar declination calculations and test cases for validating astronomical angle computations.",
  "frontend/src/lib/timezoneOffsetUtils.ts": "Utility for determining timezone IDs matching a UTC offset using quarter-hour rounding and DST-aware Intl APIs.",
  "frontend/src/lib/timezoneUtils.ts": "Loads, validates, caches, and retrieves timezone GeoJSON data using IndexedDB and a backend fallback.",
  "frontend/src/lib/TzOverlayV2.ts": "Implements timezone boundary rendering on a 3D globe with coordinate utilities, offset lookup, and overlay group management.",
  "frontend/src/main.tsx": "Initializes the React app root and wraps it with query and identity providers.",
  "frontend/src/pages/CountryMapExplorer.tsx": "Placeholder page file with no current implementation.",
  "frontend/src/pages/LocationMapExplorer.tsx": "Implements an interactive 2D/3D map explorer with search, UI panels, city layers, and travel-related features.",
  "frontend/src/utils/itineraryDateFormat.ts": "Formats a start/end date range into a compact human-readable itinerary string.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes project state, requirements, and layout changes for itinerary and schedule views."
}