{
  "backend/main.mo": "Defines the main actor with maps for journeys, locations, media, schedules, bookmarks, and includes blob-storage plus types for all data models.",
  "backend/migration.mo": "Contains migration logic converting old schedule items to the new format by adding the journeyCity field.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, associated frontend files, components, and test IDs for journey‑aware map behavior.",
  "frontend-file-summaries.txt": "Aggregated summaries describing the purpose and recent changes across key frontend components and hooks.",
  "frontend/index.html": "Base HTML file that loads the root React application and includes the SunCalc script.",
  "frontend/src/App.tsx": "Sets up global providers and renders the BackendDebugger and LocationMapExplorer.",
  "frontend/src/components/AdminPanel.tsx": "Admin interface for managing journeys and schedule items with date‑range selection and multiple management panels.",
  "frontend/src/components/BackendDebugger.tsx": "Exposes backend actor and debug utilities to the browser console for development use.",
  "frontend/src/components/CityAlbumManager.tsx": "Manages city albums, including media uploads, validation, social media links, and album selection.",
  "frontend/src/components/CityloguePanel.tsx": "Empty or placeholder file with no content.",
  "frontend/src/components/GeonameGeographicalManager.tsx": "Provides UI for importing, browsing, searching, and editing Geoname city data with pagination and file upload parsing.",
  "frontend/src/components/HeartRating.tsx": "Implements a 10-heart interactive rating widget with partial fills and click-based rating adjustments.",
  "frontend/src/components/InteractiveGlobe.tsx": "Renders a 3D interactive globe with time zones, city markers, animations, and configurable display layers.",
  "frontend/src/components/LocationInfoDialog.tsx": "Dialog for adding, editing, uploading, and deleting location photos tied to geographic coordinates.",
  "frontend/src/components/LoginPanel.tsx": "Authentication panel handling Internet Identity login/logout with status display and error handling.",
  "frontend/src/components/MapComponent.tsx": "Leaflet-based map component that loads travel spots, schedule items, and bookmarks, rendering markers and popups with media and controls.",
  "frontend/src/components/MediaGalleryPopup.tsx": "Displays photos, videos, and embedded social media links in a tabbed media gallery with YouTube/Instagram parsing.",
  "frontend/src/components/MusicAlbumManager.tsx": "Admin interface for creating, editing, and managing music albums and songs, including file uploads and queries.",
  "frontend/src/components/MusicPanel.tsx": "User-facing music browser that lists albums and songs, allowing selection and playback via a dialog UI.",
  "frontend/src/components/MusicPlayerBar.tsx": "Audio player bar that plays songs from albums, handling playback, volume, progress, and external song selection.",
  "frontend/src/components/TimezoneManagement.tsx": "Provides UI to upload, validate, store, and manually sync timezone GeoJSON data using backend actor and IndexedDB.",
  "frontend/src/components/TraveloguePanel.tsx": "Displays and edits journey itineraries with filtering, date formatting, and schedule item management.",
  "frontend/src/components/TravelSpotManager.tsx": "Manages travel spots with CRUD operations, geocoding, media uploads, and social media links via custom hooks.",
  "frontend/src/components/VibesPanel.tsx": "Shows bookmarked and travel spot vibes grouped by city, enriched with spot types and icons for filtering and focus actions.",
  "frontend/src/components/WebsiteLayoutPanel.tsx": "Allows users to view and edit website layout preferences such as UI options, search defaults, and display settings.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and utilities for backend interactions, including geocoding, country normalization, and social media URL validation.",
  "frontend/src/index.css": "Configures Tailwind CSS layers, custom CSS variables for themes, and global styling including dark and light mode rules.",
  "frontend/src/lib/solarCalculations.ts": "Provides a function to compute solar declination by day of year and includes console-based test cases.",
  "frontend/src/lib/timezoneOffsetUtils.ts": "Offers utilities to determine timezone IDs for a given UTC offset with quarter‑hour precision using Intl-based calculations.",
  "frontend/src/lib/timezoneUtils.ts": "Provides timezone boundary loading and caching logic using IndexedDB and backend fetches.",
  "frontend/src/lib/TzOverlayV2.ts": "Implements timezone overlay rendering on a 3D globe with utilities for coordinate handling, offset matching, and group management.",
  "frontend/src/main.tsx": "Initializes the React app root with query client and Internet Identity provider.",
  "frontend/src/pages/CountryMapExplorer.tsx": "Empty placeholder page component for country map exploration.",
  "frontend/src/pages/LocationMapExplorer.tsx": "Interactive 2D/3D map explorer with search, panels, overlays, and time‑zone display controls.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "Holds project metadata and feature requirements for integrating journey-based schedule items into the 2D map."
}