{
  "backend/main.mo": "Main backend actor defining data types (Journey, LocationInfo, UserProfile, CityRating, CityAlbum, TravelSpot, MusicAlbum, WebsiteLayoutSettings, ScheduleItem, MapBookmark, GeonameCity) and state variables with OrderedMaps for storing application data, integrating BlobStorage and AccessControl modules.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features for enhancing the journey edit modal with interactive calendar popovers, time selection controls, schedule validation, and backend persistence of modified journey dates and times.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including App.tsx, CountryMapExplorer.tsx, MapComponent.tsx, AdminPanel.tsx, and various other components describing their functionality, recent enhancements, and integration points.",
  "frontend/index.html": "HTML entry point for the Country Map Explorer application that includes the SunCalc library for sun position calculations and mounts the React app to the root div.",
  "frontend/src/App.tsx": "Root React component that sets up QueryClient, ThemeProvider, InternetIdentityProvider, and renders LocationMapExplorer with BackendDebugger and Toaster components for global state management and notifications.",
  "frontend/src/components/AdminPanel.tsx": "Admin control panel component managing journeys and schedules with collapsible sections, featuring add/edit/delete operations for journeys with calendar popovers for date selection, time dropdowns, schedule item validation against journey date ranges, and integration with backend mutations for persistence.",
  "frontend/src/components/BackendDebugger.tsx": "Development utility component that exposes the backend actor to window.backend for console debugging, displays current principal and role information, and provides instructions for admin role verification and temporary admin promotion commands.",
  "frontend/src/components/CityAlbumManager.tsx": "Manages city photo/video albums with file upload, social media link management, and authentication via Internet Identity. Supports multiple media formats (JPEG, PNG, WebP, AVIF, MP4, MOV) with validation and progress tracking.",
  "frontend/src/components/CityloguePanel.tsx": "Empty file with no content.",
  "frontend/src/components/GeonameGeographicalManager.tsx": "Manages geographical city data from Geonames format, supporting bulk import from TSV files, CRUD operations, pagination, and search. Classifies cities by feature codes (capital, global, major, regional, etc.).",
  "frontend/src/components/HeartRating.tsx": "Interactive heart-based rating component supporting 0.1-10.0 scale with partial fills, hover effects, and click-position-based rating selection. Supports readonly mode and multiple sizes.",
  "frontend/src/components/InteractiveGlobe.tsx": "3D globe visualization using Three.js with timezone overlays, city markers, country borders, solar terminator/twilight rendering, flight animations, and interactive controls. Includes object pooling for performance optimization.",
  "frontend/src/components/itinerary/DoodleItineraryDialogContent.tsx": "React component that displays a journey itinerary in a playful scrapbook/doodle style with colorful headers, polaroid-style schedule items, and Comic Sans MS font styling.",
  "frontend/src/components/itinerary/RetroItineraryDialogContent.tsx": "React component that renders a journey itinerary with a vintage postcard aesthetic, featuring postage stamp effects, serif fonts, and retro ribbon-style day headers.",
  "frontend/src/components/LocationInfoDialog.tsx": "Dialog for adding/editing/deleting location photos with file upload, preview, validation (image type, 10MB max), and integration with blob storage. Supports CRUD operations for location information.",
  "frontend/src/components/LoginPanel.tsx": "Authentication panel using Internet Identity with login/logout functionality, status display, and principal ID truncation. Shows loading states and handles authentication errors with toast notifications.",
  "frontend/src/components/MapComponent.tsx": "Interactive map component using Leaflet that displays travel spots, bookmarks, and schedule items with custom markers, popups showing ratings/media, and supports adding new bookmarks with journey filtering and route visualization.",
  "frontend/src/components/MediaGalleryPopup.tsx": "Tabbed media gallery component that displays photos, videos, and embedded social media content (YouTube/Instagram) with navigation controls and fullscreen support.",
  "frontend/src/components/MusicAlbumManager.tsx": "Admin interface for managing music albums and songs, including CRUD operations, file uploads, search/filter functionality, and authentication checks.",
  "frontend/src/components/MusicPanel.tsx": "Dialog-based music browser that displays all albums and songs from the collection, allowing users to select tracks for playback with album/artist metadata display.",
  "frontend/src/components/MusicPlayerBar.tsx": "Persistent audio player bar with playback controls (play/pause, skip, volume), progress tracking, and auto-play support that can be controlled externally or manage its own playlist.",
  "frontend/src/components/TimezoneManagement.tsx": "Manages timezone GeoJSON data upload and storage, allowing users to upload GeoJSON files, validate them, persist to backend canister, and cache in IndexedDB. Includes manual execution workflow with step-by-step verification and toast notifications.",
  "frontend/src/components/TraveloguePanel.tsx": "Displays journeys with collapsible itineraries, schedule items grouped by day, and filtering by live/upcoming/past status. Supports flight animations between cities, 2D map views, and both doodle and retro itinerary dialog views.",
  "frontend/src/components/TravelSpotManager.tsx": "Provides CRUD operations for travel spots with city filtering, type categorization (Hotel, Restaurant, Beach, etc.), heart-based ratings, media file uploads, and social media link management. Includes preview functionality for media and social links.",
  "frontend/src/components/VibesPanel.tsx": "Aggregates and displays bookmarks and travel spots grouped by city with collapsible sections, type-based icons (Hotel, Restaurant, Heritage, etc.), and focus handlers. Enhances vibe items with spot type information from travel spot data.",
  "frontend/src/components/WebsiteLayoutPanel.tsx": "Provides website configuration UI with tabs for map settings and display settings, including music player toggle and default search place configuration. Displays local time and persists preferences to backend.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with authentication, creating anonymous or authenticated actors based on Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks and utilities for backend data operations including location geocoding via Nominatim API, social media URL validation (YouTube/Instagram), and country name normalization.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including color schemes for UI components, music player styling, and specific heading color rules for different background modes.",
  "frontend/src/lib/solarCalculations.ts": "Calculates solar declination angles for any day of the year using Earth's axial tilt formula, with test cases validating equinoxes and solstices.",
  "frontend/src/lib/timezoneOffsetUtils.ts": "Provides utility functions to retrieve timezone IDs matching a given UTC offset with quarter-hour precision, using the Intl API for DST-aware calculations.",
  "frontend/src/lib/timezoneUtils.ts": "Manages timezone boundary data loading from backend or IndexedDB cache, with validation and point-in-polygon detection for determining timezones from coordinates.",
  "frontend/src/lib/TzOverlayV2.ts": "Renders timezone boundaries on a 3D globe with quarter-hour precision, including functions for coordinate conversion, longitude unwrapping, polygon processing, and dynamic offset-based timezone filtering using the Intl API.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/CountryMapExplorer.tsx": "Empty file with no content.",
  "frontend/src/pages/LocationMapExplorer.tsx": "Main explorer page component managing location search, 2D/3D map views, travel spots, bookmarks, music player, timezone overlays, and globe controls with extensive state management.",
  "frontend/src/utils/scheduleDayStyling.ts": "Provides color palette and utility functions for styling multi-day journey schedules, including day label generation, color assignment, and day index computation from timestamps.",
  "frontend/src/utils/scheduleRouteUtils.ts": "Groups and sorts schedule items by calendar day and time, building chronological route coordinates for multi-day journey visualization.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for a 3D globe travel app, documenting known issues with journey title persistence and read-only date displays in the edit modal, plus in-progress feature requests to add full date/time editing with schedule validation."
}