{
  "backend/main.mo": "Defines maps and data types for journeys, cities, media, schedules, bookmarks, and user profiles, initializing registry and access control state in an actor.",
  "feature_evidence.json": "Lists feature evidence entries linking features to frontend files, components, test IDs, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend source files describing their roles and recent enhancements.",
  "frontend/index.html": "Basic HTML entrypoint loading the React app via main.tsx and including the suncalc library.",
  "frontend/src/App.tsx": "Bootstraps providers and renders BackendDebugger, LocationMapExplorer, and global toast notifications.",
  "frontend/src/components/AdminPanel.tsx": "Provides UI for managing journeys and schedules with calendar popovers, mutations, and multiple management panels.",
  "frontend/src/components/BackendDebugger.tsx": "Exposes backend actor and debugging utilities to the browser console for development purposes.",
  "frontend/src/components/CityAlbumManager.tsx": "UI for selecting cities, uploading media, managing social media links, and editing city albums with validation and file storage integration.",
  "frontend/src/components/CityloguePanel.tsx": "Empty or placeholder component with no implementation provided.",
  "frontend/src/components/GeonameGeographicalManager.tsx": "Admin interface for importing, searching, paginating, creating, editing, and deleting Geoname city records with file parsing and validation.",
  "frontend/src/components/HeartRating.tsx": "Interactive 10-heart fractional rating component supporting hover, click-based precision, and read‑only mode.",
  "frontend/src/components/InteractiveGlobe.tsx": "Three.js-based interactive globe with timezone overlays, labels, flight animation, and various visualization toggles.",
  "frontend/src/components/LocationInfoDialog.tsx": "Dialog for creating or updating location info, including image upload, preview, deletion, and associated backend mutations.",
  "frontend/src/components/LoginPanel.tsx": "Authentication panel using Internet Identity with login/logout, status display, and session handling.",
  "frontend/src/components/MapComponent.tsx": "Leaflet-based map component managing markers for travel spots, bookmarks, and schedule items with custom icons and focus behavior.",
  "frontend/src/components/MediaGalleryPopup.tsx": "Displays photos, videos, and embedded social media content with tabbed navigation and media-type detection utilities.",
  "frontend/src/components/MusicAlbumManager.tsx": "Admin interface for creating, editing, and deleting music albums and songs with file uploads and form dialogs.",
  "frontend/src/components/MusicPanel.tsx": "Popup music browser showing albums and songs, enabling selection and playback triggers when authenticated.",
  "frontend/src/components/MusicPlayerBar.tsx": "Bottom music player handling audio playback, song navigation, volume, and integrating user layout preferences.",
  "frontend/src/components/TimezoneManagement.tsx": "Provides UI for uploading, validating, storing, and manually executing sync of timezone GeoJSON data using backend and IndexedDB.",
  "frontend/src/components/TravelogueJourneyMapDialog.tsx": "Displays journey schedule items on a Leaflet map, dynamically loading the library, geocoding locations, and rendering markers.",
  "frontend/src/components/TraveloguePanel.tsx": "Shows journeys and schedules with filtering, editing, and navigation hooks, including date/time formatting and collapsible UI.",
  "frontend/src/components/TravelSpotManager.tsx": "Manages CRUD for travel spots, including media uploads and social media links, with dialogs, forms, and city-based filtering.",
  "frontend/src/components/VibesPanel.tsx": "Aggregates bookmarks and travel spots by city, enriches items with spot types, and displays them in collapsible groups with icons.",
  "frontend/src/components/WebsiteLayoutPanel.tsx": "React panel component for managing website layout preferences such as music player visibility and default search location, with dialogs, tabs, and update handlers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, logout, identity loading, and auth client setup with status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of data-fetching and mutation hooks using react-query, including geocoding, social media URL validation, and website layout preference operations.",
  "frontend/src/index.css": "Tailwind base styles and extensive CSS variables for theming, including light/dark mode and custom component color sets.",
  "frontend/src/lib/solarCalculations.ts": "Provides a solar declination calculator and simple console-based test cases for key seasonal dates.",
  "frontend/src/lib/timezoneOffsetUtils.ts": "Finds timezone IDs matching a given UTC offset by computing and rounding each zone’s current offset.",
  "frontend/src/lib/timezoneUtils.ts": "Loads, caches, and validates timezone boundary GeoJSON using IndexedDB and optional backend fetching.",
  "frontend/src/lib/TzOverlayV2.ts": "Utility functions for rendering timezone overlays on a 3D globe, including coordinate conversion, longitude unwrapping, and timezone offset matching.",
  "frontend/src/main.tsx": "Initializes the React app root with query client and Internet Identity context.",
  "frontend/src/pages/CountryMapExplorer.tsx": "Empty placeholder file for a country map explorer page.",
  "frontend/src/pages/LocationMapExplorer.tsx": "Implements an interactive 2D/3D map UI with search, timezone overlays, panels, flight animations, and URL‑state syncing.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, setting, and clearing URL parameters using hash‑based or regular routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and components with plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state for changing the Travelogue Map button to navigate to a 2D view and focus the selected journey/schedule item, listing existing features and a pending request."
}