{
  "kind": "build_request",
  "title": "Add placeholder Map (2D) button next to Flying in Travelogue",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Travelogue UI, add a new button labeled \"Map\" positioned immediately to the right of the existing \"Flying\" button wherever the Flying button is rendered (i.e., within each journey card’s action controls). The Map button must display a clear \"2D\" logo/icon (text-based is acceptable, e.g., a compact “2D” mark) alongside the \"Map\" label.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1) add a button with 2D as logo, namely \"Map\", right next to the Flying button in the travelogue"
        ]
      },
      "acceptanceCriteria": [
        "In the Travelogue panel, each journey card that shows the Flying button also shows a new Map button immediately to its right.",
        "The Map button’s visible label text is exactly \"Map\".",
        "The Map button includes a visible \"2D\" logo/icon mark."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the new \"Map\" button is a no-op placeholder: clicking/tapping it must not navigate, open dialogs, trigger toasts, call backend APIs, or otherwise change application state or UI beyond standard button press visuals.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2) do not add anything in this \"Map\" button yet"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the Map button produces no navigation or panel/dialog changes.",
        "No toast/notification is shown as a result of clicking the Map button.",
        "No backend calls are initiated by clicking the Map button."
      ]
    }
  ],
  "constraints": [
    "Do not modify any backend canister code for this change.",
    "Do not add any functional behavior to the new Map button beyond rendering it in the UI.",
    "Do not edit files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing a 2D map view or connecting the Map button to the existing Leaflet/2D explorer.",
    "Adding routing/deep-links for the Map button.",
    "Changing the existing Flying button behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}