{
  "kind": "build_request",
  "title": "Add Map button in Travelogue to open 2D map with selected journey schedule items",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Travelogue journey action row, add a new button labeled \"Map\" with a 2D/map-style icon, positioned next to the existing \"Flying\" button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "1) add a button with 2D as logo, namely \"Map\", next to the Flying button in the travelogue"
        ]
      },
      "acceptanceCriteria": [
        "Each journey card shows a \"Map\" button next to the existing \"Flying\" button.",
        "The button label is exactly \"Map\" (English).",
        "The button includes a 2D/map-style icon (e.g., lucide Map)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "When the new \"Map\" button is clicked for a journey, switch the main explorer to the existing 2D map view and display all schedule items for that journey on the 2D map according to each schedule item’s input location.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "2) when this button is clicked, all the schedule item of that journey will be displayed on the 2d Map (direct to the existing one) in accordance to the locations input"
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Map\" switches the app’s main view mode to the existing 2D map (no new map page is created).",
        "All schedule items belonging to the selected journey are rendered as markers/items on the 2D map.",
        "The marker positions are driven by each schedule item’s `location` input value (e.g., via existing geocoding / location lookup logic already used by the map).",
        "If one or more schedule items cannot be mapped to coordinates, the app does not crash and shows a user-visible error/toast indicating some locations could not be displayed."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Wire TraveloguePanel and LocationMapExplorer together with a callback/event so the Travelogue \"Map\" button can trigger 2D mode and provide the selected journey identifier and its schedule items (or enough data) to MapComponent for rendering.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "when this button is clicked, all the schedule item of that journey will be displayed on the 2d Map (direct to the existing one)"
        ]
      },
      "acceptanceCriteria": [
        "TraveloguePanel exposes a new prop callback (e.g., `onMapJourney(...)`) invoked when \"Map\" is clicked.",
        "LocationMapExplorer implements the callback to: (1) set view mode to '2D', (2) center the 2D map appropriately for the journey, and (3) pass journey schedule items (or derived map points) down to MapComponent.",
        "MapComponent renders the passed journey schedule items without requiring manual user search input."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components only).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Do not implement a new mapping provider or replace the existing 2D map implementation.",
    "Do not add new backend schema/state changes unless strictly required for showing schedule items on the map."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}