{
  "kind": "build_request",
  "title": "Draw same-day route lines between schedule items on the map (chronological order)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the 2D map schedule-item rendering (the schedule item SVG/text marker elements identified by the user’s selected XPaths), draw a visible route line that links all schedule items occurring on the same calendar day.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "1) Link the same day schedule items with a route line (same color as the logo)"
        ]
      },
      "acceptanceCriteria": [
        "When viewing schedule items on the 2D map, schedule items that share the same date are connected by a continuous line.",
        "The route line is only applied to the schedule-item map elements in scope (the selected schedule SVG/text marker elements), and does not change unrelated map layers (travel spots, bookmarks, etc.).",
        "If a day has fewer than 2 schedule items with valid coordinates, no route line is drawn for that day.",
        "Route lines are removed/updated correctly when the underlying schedule items change (no duplicate/stacked old polylines after re-render)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "For each day’s route line, order the connected schedule items chronologically starting from the earliest item of that day, and use a stroke color that matches the schedule item logo/day color used for that same day.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "2) starting the route line with the earliest,  in chronological order, of each day",
          "1) Link the same day schedule items with a route line (same color as the logo)"
        ]
      },
      "acceptanceCriteria": [
        "Within each day group, the polyline path connects schedule items sorted by their time (earliest to latest) for that day.",
        "The route line stroke color for a given day matches the day color used by that day’s schedule item logo/label styling (i.e., consistent with the existing day-based color logic).",
        "Different days render as separate lines (no cross-day connections)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Respect the existing Leaflet-based map architecture (no new backend services, no external databases, no real-time sockets)."
  ],
  "nonGoals": [
    "Do not change backend data models or persistence for schedule items.",
    "Do not add new scheduling features (editing, reordering, or new filters) beyond drawing the route line and enforcing chronological connection order.",
    "Do not redesign the overall map UI beyond adding the route-line visualization."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}