{
  "kind": "build_request",
  "title": "Change Travelogue Map button to navigate to 2D view and focus the selected journey/schedule item (no popup)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the current Travelogue “Map” button behavior that opens a popup/dialog with navigation to the existing 2D map view in LocationMapExplorer, centered on the selected journey city.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "when clicking the map button, instead of poping up a new pop up box, please direct it to the 2d page with the respective journey city"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the Travelogue Map button does not open any dialog/popup (no overlay div is rendered for this action).",
        "After clicking the Travelogue Map button, the app switches to the 2D view and searches/centers the map on the journey’s city name (using the existing search flow)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "When the Travelogue Map button is invoked for a specific schedule item, ensure the 2D map view also displays and focuses the corresponding schedule item (e.g., by automatically opening/spotlighting that schedule item’s marker/popup on the 2D map).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "and display the corresponding schedule item"
        ]
      },
      "acceptanceCriteria": [
        "If a schedule item is the source of the Map action, the 2D map automatically highlights that schedule item (marker is visually distinguishable and/or its popup is opened).",
        "The focused schedule item shown on the 2D map matches the originating schedule item (date/time/activity/location)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement a URL/state handoff so that switching to the 2D view from the Map button persists enough information to load the correct journey city and schedule item even after a page refresh (use the existing URL param utilities in frontend/src/utils/urlParams.ts).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ]
      },
      "acceptanceCriteria": [
        "Triggering the Map action updates the URL (query or hash query) with parameters sufficient to restore the 2D view selection on refresh.",
        "Refreshing the page after using the Map action restores the 2D view and re-focuses the intended city and schedule item without user re-clicking."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Apply the behavior change only to the user-selected UI elements (the Map button control in the header and the popup container currently used for the Map action), ensuring other dialogs (e.g., itinerary and edit schedule dialogs) continue to function unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "/html[1]/body[1]/div[5]",
          "/html[1]/body[1]/div[1]/div[2]/div[1]/header[1]/div[1]/div[1]/form[1]/div[1]/div[1]/div[1]/button[2]"
        ]
      },
      "acceptanceCriteria": [
        "No unrelated buttons or dialogs change behavior.",
        "The popup/dialog that previously appeared for the Map action is no longer shown, while other existing popups (e.g., edit schedule item) still open and work normally."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Backend must remain single-actor; no new backend services."
  ],
  "nonGoals": [
    "Do not add new backend endpoints or change Motoko data models for this request.",
    "Do not redesign the overall Travelogue UI beyond changing the Map action flow.",
    "Do not add real-time features (WebSockets) or third-party auth providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}