{
  "kind": "build_request",
  "title": "Revise itinerary header date format/placement and improve schedule row wrapping + between-row dotted connectors",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the journey period display (selected Element 1: XPath /html[1]/body[1]/div[5]/div[1]/div[7]/div[1]/div[1]/h1[1]) to use the format \"18 Feb 26 (Wed) ~ 20 Feb 26 (Fri)\" (day + short month + 2-digit year + short weekday for both start and end), derived from the existing journey startDate/endDate values.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1) to element 1 only"
        ]
      },
      "acceptanceCriteria": [
        "The journey period text renders in the exact pattern \"DD MMM YY (ddd) ~ DD MMM YY (ddd)\" (e.g., \"18 Feb 26 (Wed) ~ 20 Feb 26 (Fri)\").",
        "The displayed range uses the journey startDate and endDate currently used for the itinerary header (no hard-coded dates).",
        "User-facing text remains in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change the header layout so the journey period (Element 1) is placed immediately next to the selected heading element (Element 2: XPath /html[1]/body[1]/div[5]/div[1]/div[7]/div[1]/p[1]) on the same line, while preserving the existing doodle/retro styling and not modifying non-selected header elements beyond what is necessary to achieve this placement.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "and put it right next to the heading element 2"
        ]
      },
      "acceptanceCriteria": [
        "Element 1 and Element 2 appear on the same horizontal line (no line break between them at typical desktop widths).",
        "On narrow screens, the layout remains readable (wrapping is allowed, but Element 1 should be visually associated with Element 2).",
        "No unrelated header content or styling outside the selected header elements is changed."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the schedule item row layout so that if the current window width cannot show the full schedule content for that row, the schedule items flow/wrap into a new row (no horizontal truncation and no horizontal scrolling for the selected schedule row container: Element 4 XPath /html[1]/body[1]/div[5]/div[1]/div[7]/div[2]/div[2]/div[1]/div[2]/div[1] and related row content container Element 3 XPath /html[1]/body[1]/div[5]/div[1]/div[7]/div[2]/div[1]/div[1]/div[1]/div[2]/div[1]).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "3) if the current window cannot show the full schedule content of that row, move the content to the next row"
        ]
      },
      "acceptanceCriteria": [
        "When the schedule item sequence exceeds the available width, items wrap to the next line instead of being clipped or requiring horizontal scrolling.",
        "The order of schedule items remains chronological when wrapped.",
        "The wrapped layout remains visually consistent with the existing doodle/retro theme."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a dotted arrow connector only between rows (not between items within the same row), to visually connect the last schedule item of the previous row to the first schedule item of the next row (either a wrapped continuation row of the same day, or the next day’s first row). Apply this only in the selected connector/arrow area (Element 5 XPath /html[1]/body[1]/div[5]/div[1]/div[7]/div[2]/div[1]/div[1]/div[2]/div[1]/div[2]/svg[1]).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2) only applies between rows"
        ]
      },
      "acceptanceCriteria": [
        "No dotted arrow connectors are shown between items that remain on the same row.",
        "A dotted arrow connector is rendered between each pair of adjacent rows of schedule items (including wrap-induced rows).",
        "The connector visually indicates direction from the end of the previous row toward the start of the next row."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Reduce the dotted arrow connector’s visual length by 50% for the between-row connector (Element 5).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "4) Reduce the arrow length by 1/2"
        ]
      },
      "acceptanceCriteria": [
        "Compared to the current arrow connector SVG sizing, the between-row arrow is approximately half the prior length/width while maintaining the same stroke style (dotted) and readability."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure long schedule text wraps instead of truncating for the selected schedule text elements (Element 6 XPath /html[1]/body[1]/div[5]/div[1]/div[7]/div[2]/div[1]/div[1]/div[2]/div[1]/div[1]/div[3]/p[1] and Element 7 XPath /html[1]/body[1]/div[5]/div[1]/div[7]/div[2]/div[1]/div[1]/div[2]/div[1]/div[1]/div[3]/p[2]). Remove truncation/line-clamping behavior and allow multi-line wrapping with word-breaking where needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "what i want to do is to wrap the text if they are long"
        ]
      },
      "acceptanceCriteria": [
        "Activity/location text in the selected elements is not truncated with ellipses and is fully readable via wrapping.",
        "Very long words/strings do not overflow their container (word-break/overflow-wrap is applied as needed).",
        "Wrapping works consistently across common viewport sizes (desktop and mobile)."
      ]
    }
  ],
  "constraints": [
    "Apply the requested changes ONLY to the elements represented by the provided selected XPaths.",
    "Maintain the existing doodle/retro visual styling; do not redesign the theme.",
    "Frontend-only change; no backend schema or Motoko logic changes are required."
  ],
  "nonGoals": [
    "Do not add new itinerary features beyond header formatting/placement, between-row connectors, wrapping behavior, and text wrapping.",
    "Do not introduce new authentication, storage, or third-party integrations.",
    "Do not change non-selected parts of the Travelogue UI (e.g., admin panels, map/globe behavior)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}