{
  "kind": "build_request",
  "title": "Add third Plain itinerary theme and adjust selected theme controls (remove star icon, wrap long text)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the star logo/icon from the selected Element 1 button (XPath: /html[1]/body[1]/div[3]/div[2]/div[1]/div[2]/div[1]/div[1]/div[1]/div[1]/div[1]/div[2]/div[2]/button[1]) without removing or changing the button’s click behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1) remove the star logo of element 1"
        ]
      },
      "acceptanceCriteria": [
        "The Element 1 button renders with no star logo/icon visible (no empty spacing where the icon used to be).",
        "The Element 1 button remains clickable and performs the same action as before."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the selected Element 2 button’s text wraps onto multiple lines when long, and that the full text content is visible (no truncation/ellipsis) (XPath: /html[1]/body[1]/div[3]/div[2]/div[1]/div[2]/div[1]/div[1]/div[1]/div[1]/div[1]/div[2]/div[2]/button[2]).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2)  wrap the text of element 2 if it is long and show all of content"
        ]
      },
      "acceptanceCriteria": [
        "When the Element 2 button label is long, it wraps to the next line(s) within the button instead of truncating.",
        "All characters of the Element 2 button label are visible (no ellipsis) at typical dialog widths."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a third itinerary theme option named \"Plain\" alongside the existing Doodle and Retro themes, selectable via the existing theme controls represented by the selected Element 1 and Element 2 buttons (XPaths above). When Plain is selected, apply a minimal, neutral, \"plain itinerary\" visual style to ONLY the selected itinerary content elements (Element 3 XPath: /html[1]/body[1]/div[5]/div[1]/div[7]/div[2]/div[1]/div[1]/div[2]/div[1]/div[1]/div[1]/div[1], Element 4 XPath: /html[1]/body[1]/div[5]/div[1]/div[7]/div[2]/div[1]/div[1]/div[2]/div[1]/div[1]/div[1]/div[2], Element 5 XPath: /html[1]/body[1]/div[5]/div[1]/div[7]/div[2]/div[1]/div[1]/div[2]/div[1]/div[1]/div[3]/p[2]).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Other than Doodle and Retro Theme, add another plain theme for user who prefer plain itinerary theme",
          "yes, add as a third option alongside with Doodle and RETRO"
        ]
      },
      "acceptanceCriteria": [
        "A third theme option labeled \"Plain\" is available alongside the existing Doodle and Retro options within the same theme-control area as Element 1 and Element 2.",
        "Selecting \"Plain\" updates the styling of the selected itinerary elements (Elements 3–5) to a minimal, neutral appearance (e.g., no doodle/illustration effects; subdued borders/shadows; neutral background and text).",
        "Switching between Doodle, Retro, and Plain updates styling accordingly, without changing any non-selected elements outside the specified XPaths."
      ]
    }
  ],
  "constraints": [
    "Apply changes ONLY to the 5 selected elements identified by the provided XPath expressions (and code that directly renders/styles those exact elements).",
    "Do not edit files in frontend immutablePaths (e.g., frontend/src/main.tsx, frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts, and frontend/src/components/ui/*).",
    "Use English for any user-facing text (e.g., the new theme label must be \"Plain\")."
  ],
  "nonGoals": [
    "Do not introduce new authentication methods or third-party identity providers.",
    "Do not add new backend data models or persistence for themes unless already required by existing UI (theme selection can remain UI-only if that is how Doodle/Retro currently work).",
    "Do not restyle the entire app globally; only adjust styling related to the selected elements and their theme representations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}