{
  "kind": "build_request",
  "title": "Enhance selected itinerary Day labels to show date and weekday (Doodle + Retro, selected elements only)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Update ONLY the two selected Day label elements in the Doodle (ScrapbookItineraryView) and Retro (RetroPostcardItineraryView) itinerary views so that each Day label renders three lines: (1) the existing “Day N” label, (2) the corresponding calendar date formatted like “11 Feb” (day number + short month in English), and (3) the corresponding weekday formatted like “Wed” (English short weekday). Use the day’s actual date from the itinerary/day grouping that the UI is rendering. Do not change the surrounding UI layout/structure beyond modifying the content within these two existing elements.\n\nSelected elements to edit:\n- Doodle Day label span XPath: /html[1]/body[1]/div[5]/div[1]/div[7]/div[2]/div[1]/div[1]/div[1]/div[1]/div[1]/span[1]\n- Retro Day label span XPath: /html[1]/body[1]/div[5]/div[1]/div[7]/div[2]/div[2]/div[1]/div[1]/div[1]/span[1]",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "Enhance the Day presentation of the selected itinerary such that the corresponding Date and the corresponding weekdays are added below. Just change the selected elements inside Doodle and Retro. Do not change the UI layout.",
          "For example:\nDay 1\n11 Feb\nWed"
        ]
      },
      "acceptanceCriteria": [
        "In the Doodle itinerary view, the selected Day label element displays three lines in this order: “Day N”, then the correct date (e.g., “11 Feb”), then the correct weekday (e.g., “Wed”), all in English.",
        "In the Retro itinerary view, the selected Day label element displays the same three-line format with the correct date and weekday for that day.",
        "The date and weekday correspond to the actual day represented by that Day section (derived from the schedule/day grouping being rendered).",
        "No other elements besides the two specified XPaths are changed.",
        "No changes are made that alter the overall layout outside the selected span elements (e.g., no new parent containers, no reflow of other components)."
      ]
    }
  ],
  "constraints": [
    "Apply changes ONLY to the two selected elements identified by the provided XPaths (Doodle and Retro Day label spans).",
    "Do not change the UI layout; only adjust the content rendering within the selected elements.",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Do not change any other itinerary styling, spacing, card layout, schedule row layout, arrows, or header formatting beyond the two selected Day label elements.",
    "Do not add new itinerary features (filters, sorting, editing, export, etc.).",
    "Do not change backend data structures or add backend endpoints."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}