{
  "kind": "build_request",
  "title": "Add non-functional 'Map' (2D logo) button next to 'Flying' in Travelogue",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "In the Travelogue journey action buttons area (selected elements context: /html[1]/body[1]/div[3]/div[2]/div[1]/div[2]/div[1]/div[1]/div[1]/div[1] and /html[1]/body[1]/div[3]/div[2]/div[1]/div[2]/div[1]), add a new button labeled \"Map\" positioned directly next to the existing \"Flying\" button, and display a simple \"2D\" logo/icon on the button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1) add a button with 2D as logo, namely \"Map\", next to the Flying button in the travelogue"
        ]
      },
      "acceptanceCriteria": [
        "A new \"Map\" button is visible next to the existing \"Flying\" button within each journey card in the Travelogue UI.",
        "The \"Map\" button includes a clearly visible \"2D\" logo/icon alongside the \"Map\" label.",
        "The existing \"Flying\" button remains present and in its original position relative to other Travelogue controls (no rearrangement)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Do not implement any functionality for the new \"Map\" button yet (no navigation, no state changes, no toasts, no map updates, and no backend calls when clicked).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2) do not add anything in this \"Map\" button yet"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the \"Map\" button produces no visible UI change and triggers no side effects (no route changes, no dialogs, no toasts, no data fetching).",
        "No backend (Motoko) changes are introduced for this request."
      ]
    }
  ],
  "constraints": [
    "Apply changes ONLY within the UI represented by the selected elements in the prompt (Travelogue button area).",
    "Do not modify any layout, styling, or content under the existing \"doodle\" and \"retro\" itinerary views.",
    "Do not rearrange the Travelogue layout or the position of existing buttons; only insert the new \"Map\" button next to \"Flying\"."
  ],
  "nonGoals": [
    "Implementing the 2D map view integration or displaying schedule items on the map.",
    "Adding new routes/pages or deep-linking behavior for the \"Map\" button.",
    "Changing backend data models or APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}