{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add no-op Map (2D) button next to Flying in Travelogue journey cards",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render a new \"Map\" button with a visible \"2D\" mark immediately to the right of the existing \"Flying\" button in each Travelogue journey card action area.",
      "acceptanceCriteria": [
        "In the Travelogue panel, each journey card that shows the Flying button also shows a new Map button immediately to its right.",
        "The Map button’s visible label text is exactly \"Map\".",
        "The Map button includes a visible \"2D\" logo/icon mark."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TraveloguePanel.tsx",
          "operation": "modify",
          "description": "Locate the journey card action controls where the existing \"Flying\" button is rendered (within the JourneyCard UI), and add a new adjacent button immediately to its right labeled exactly \"Map\" with a compact visible \"2D\" mark/icon alongside the label (text-based is acceptable). Ensure the new button is rendered everywhere the Flying button appears (for live/upcoming/past journey cards). Do not edit any files under frontend/src/components/ui."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the new \"Map\" button a pure no-op placeholder that only shows standard press visuals and does not change state, navigate, or trigger side effects.",
      "acceptanceCriteria": [
        "Clicking the Map button produces no navigation or panel/dialog changes.",
        "No toast/notification is shown as a result of clicking the Map button.",
        "No backend calls are initiated by clicking the Map button."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TraveloguePanel.tsx",
          "operation": "modify",
          "description": "Implement the \"Map\" button click handler as a no-op placeholder (e.g., prevent default/stop propagation if needed) and ensure it does not call any hooks/mutations, does not set React state, does not open dialogs, does not trigger toasts, and does not initiate network/backend calls. Keep existing Flying behavior unchanged."
        }
      ]
    }
  ]
}