{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Same-day chronological route polylines between schedule items on the 2D Leaflet map",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Draw a visible route line on the 2D Leaflet map that links schedule-item marker elements occurring on the same calendar day, scoped only to schedule items.",
      "acceptanceCriteria": [
        "When viewing schedule items on the 2D map, schedule items that share the same date are connected by a continuous line.",
        "The route line is only applied to the schedule-item map elements in scope (the selected schedule SVG/text marker elements), and does not change unrelated map layers (travel spots, bookmarks, etc.).",
        "If a day has fewer than 2 schedule items with valid coordinates, no route line is drawn for that day.",
        "Route lines are removed/updated correctly when the underlying schedule items change (no duplicate/stacked old polylines after re-render)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/scheduleRouteUtils.ts",
          "operation": "create",
          "description": "Add frontend-only helpers to: (1) group schedule items by calendar day using the ScheduleItem.date value, (2) filter to items with valid coordinates, and (3) build per-day ordered coordinate sequences suitable for Leaflet polyline rendering."
        },
        {
          "path": "frontend/src/components/MapComponent.tsx",
          "operation": "modify",
          "description": "Add a dedicated Leaflet layer (e.g., a layerGroup stored in a ref) for schedule-item route polylines, and render one polyline per day group derived from the same schedule items used for schedule marker rendering (to keep scope limited to the selected schedule SVG/text marker elements). Ensure the layer is cleared/replaced on relevant data changes and removed on unmount to prevent duplicate/stacked polylines and to avoid impacting travel spot/bookmark layers."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Within each day, connect schedule items in chronological order and color each day’s route line to match the existing day-based schedule styling.",
      "acceptanceCriteria": [
        "Within each day group, the polyline path connects schedule items sorted by their time (earliest to latest) for that day.",
        "The route line stroke color for a given day matches the day color used by that day’s schedule item logo/label styling (i.e., consistent with the existing day-based color logic).",
        "Different days render as separate lines (no cross-day connections)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/scheduleRouteUtils.ts",
          "operation": "modify",
          "description": "Implement robust chronological sorting within each day group based on ScheduleItem.time (e.g., parse HH:mm; push invalid/missing times to the end deterministically). Return per-day groups that preserve day separation and provide stable ordering for polyline point connection."
        },
        {
          "path": "frontend/src/components/MapComponent.tsx",
          "operation": "modify",
          "description": "When creating each day’s Leaflet polyline, apply a stroke color derived from the same day-based color logic already used for schedule item styling (use computeDayIndex + getDayColor from frontend/src/utils/scheduleDayStyling.ts against the same schedule item set). Ensure each day renders as its own distinct polyline with no cross-day points connected."
        }
      ]
    }
  ]
}