{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add full date/time editing to journey edit modal",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace read-only date displays in the journey edit modal with interactive calendar popovers matching the 'Add New Journey' form implementation",
      "acceptanceCriteria": [
        "Journey edit modal includes calendar popovers for both start date and end date fields",
        "Date pickers use the same Calendar component and Popover pattern as the Add New Journey form",
        "Selected dates update the journey's date range when saved"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "modify",
          "description": "Replace the read-only date Text inputs in the Edit Journey dialog with interactive Popover + Calendar components. Use the exact same pattern and imports from the 'Add New Journey' form section (lines with CalendarIcon, Popover, PopoverTrigger, PopoverContent, Calendar, format from date-fns). Update the editJourney state to store Date objects instead of formatted strings for startDate and endDate. Add date selection handlers (setDate) that update editJourney.startDate and editJourney.endDate respectively."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add time selection controls to the journey edit modal for both start time and end time using Select components with hour and minute dropdowns",
      "acceptanceCriteria": [
        "Journey edit modal includes hour and minute Select dropdowns for start time",
        "Journey edit modal includes hour and minute Select dropdowns for end time",
        "Time controls match the styling and behavior of the Add New Journey form",
        "Selected times update the journey's time range when saved"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "modify",
          "description": "Add time selection controls to the Edit Journey dialog by duplicating the Select (hour/minute) pattern from the 'Add New Journey' form. Create state variables for startHour, startMinute, endHour, endMinute within the edit flow. Add two rows of Select components (one for start time, one for end time) below the date pickers. Populate Select options with hours (00-23) and minutes (00-59) matching the existing form. Wire onChange handlers to update the respective time state variables."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement validation in the journey edit modal to ensure all schedule items fall within the newly selected journey date range",
      "acceptanceCriteria": [
        "Before saving, the system checks that all schedule items for the journey fall within the new start and end date/time range",
        "If any schedule items fall outside the new range, display a descriptive error message listing affected items",
        "User cannot save the journey edit if validation fails",
        "Validation accounts for both date and time components of schedule items"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "modify",
          "description": "Add schedule validation logic to the handleUpdateJourney function before calling the updateJourney mutation. Fetch all schedule items for the journey using the scheduleItems state or a filtered list from allScheduleItems. Construct full Date objects from the new start/end dates and times. Loop through all schedule items and check if each item's date+time falls within the new journey period. If any items fall outside, collect their details (location, activity, date/time) and display a toast error message listing the conflicting items. Prevent the mutation from executing if validation fails. Use the existing toast system for error display."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update the backend updateJourney mutation call to include modified startDate, endDate, and time fields",
      "acceptanceCriteria": [
        "The edit modal mutation sends updated startDate and endDate values to the backend",
        "Start and end times are included in the backend update payload",
        "Backend successfully updates and persists the modified journey period",
        "Edited journey reflects new dates and times in all UI components (Travelogue, Globe, Map)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "modify",
          "description": "Modify the handleUpdateJourney function to construct complete Date objects combining the selected dates with the hour/minute values. Convert startDate + startHour + startMinute into a single timestamp (BigInt nanoseconds). Convert endDate + endHour + endMinute into a single timestamp (BigInt nanoseconds). Pass these constructed timestamps as startDate and endDate arguments to the updateJourneyMutation.mutateAsync call. Ensure the mutation payload matches the backend signature: updateJourney(city: string, startDate: Time, endDate: Time). After successful mutation, invalidate relevant queries (['journeys']) to refresh all journey displays."
        }
      ]
    }
  ]
}