{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add third Plain itinerary theme and adjust selected theme controls (remove star icon, wrap long text)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the star logo/icon from the selected Element 1 theme button while preserving its click behavior and layout.",
      "acceptanceCriteria": [
        "The Element 1 button renders with no star logo/icon visible (no empty spacing where the icon used to be).",
        "The Element 1 button remains clickable and performs the same action as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TraveloguePanel.tsx",
          "operation": "modify",
          "description": "Locate the JSX that renders the theme control button corresponding to Element 1 (Doodle/illustrated theme control in the itinerary theme-control area). Remove the star icon element (and any icon wrapper/gap styling) from that button only, ensuring the onClick handler and selection logic remain unchanged and the button content has no leftover spacing reserved for the icon."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the selected Element 2 theme button label wrap to multiple lines with no truncation/ellipsis.",
      "acceptanceCriteria": [
        "When the Element 2 button label is long, it wraps to the next line(s) within the button instead of truncating.",
        "All characters of the Element 2 button label are visible (no ellipsis) at typical dialog widths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TraveloguePanel.tsx",
          "operation": "modify",
          "description": "Update the JSX/className for the theme control button corresponding to Element 2 so its label can wrap (e.g., remove any truncate/ellipsis/whitespace-nowrap/line-clamp styling and ensure multiline wrapping with normal whitespace and word breaking). Limit the change to the Element 2 button rendering so other buttons/text in the app are unaffected."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a third itinerary theme option labeled \"Plain\" and apply a minimal, neutral style to only the specified itinerary content elements when selected.",
      "acceptanceCriteria": [
        "A third theme option labeled \"Plain\" is available alongside the existing Doodle and Retro options within the same theme-control area as Element 1 and Element 2.",
        "Selecting \"Plain\" updates the styling of the selected itinerary elements (Elements 3–5) to a minimal, neutral appearance (e.g., no doodle/illustration effects; subdued borders/shadows; neutral background and text).",
        "Switching between Doodle, Retro, and Plain updates styling accordingly, without changing any non-selected elements outside the specified XPaths."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TraveloguePanel.tsx",
          "operation": "modify",
          "description": "Extend the existing itinerary theme controls (the same control group that currently exposes Doodle and Retro via Element 1 and Element 2) to include a third selectable option labeled \"Plain\" (English text). Implement/extend local UI state for the selected theme (UI-only unless an existing mechanism already persists it), wire the new \"Plain\" button into the same selection mechanism, and apply theme-specific classNames ONLY to the three specified itinerary content elements (Elements 3–5) so that only those elements change appearance when switching themes."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add narrowly-scoped CSS rules/classes to support the \"Plain\" itinerary styling (minimal/neutral) and any theme-specific overrides needed for Elements 3–5. Ensure the selectors/classes are applied only by the three itinerary elements updated in frontend/src/components/TraveloguePanel.tsx, so no global restyling occurs outside the specified XPaths."
        }
      ]
    }
  ]
}