{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Selected itinerary Day labels: add date + weekday lines (Doodle + Retro)",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Update only the selected Day label spans in ScrapbookItineraryView (Doodle) and RetroPostcardItineraryView (Retro) to render three lines: “Day N”, “DD Mon”, and “Ddd” based on the actual date for that rendered day section.",
      "acceptanceCriteria": [
        "In the Doodle itinerary view, the selected Day label element displays three lines in this order: “Day N”, then the correct date (e.g., “11 Feb”), then the correct weekday (e.g., “Wed”), all in English.",
        "In the Retro itinerary view, the selected Day label element displays the same three-line format with the correct date and weekday for that day.",
        "The date and weekday correspond to the actual day represented by that Day section (derived from the schedule/day grouping being rendered).",
        "No other elements besides the two specified XPaths are changed.",
        "No changes are made that alter the overall layout outside the selected span elements (e.g., no new parent containers, no reflow of other components)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TraveloguePanel.tsx",
          "operation": "modify",
          "description": "Within ScrapbookItineraryView and RetroPostcardItineraryView, change ONLY the two existing Day label <span> elements matching the provided XPaths to render 3 lines (using line breaks inside the same span): (1) existing “Day N”, (2) date formatted in English as “DD Mon” (e.g., “11 Feb”), and (3) weekday formatted in English as “Ddd” (e.g., “Wed”). Derive the date from the actual day section being rendered (e.g., from that day’s grouping key or the first ScheduleItem date in the group) and format with Intl.DateTimeFormat/toLocaleDateString in English. Do not add new parent containers or modify any surrounding layout/structure; do not modify any other elements."
        }
      ]
    }
  ]
}