{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add non-functional Map (2D icon) button next to Flying in Travelogue",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Insert a new \"Map\" button with a simple \"2D\" icon directly next to the existing \"Flying\" button in each Travelogue journey card action area.",
      "acceptanceCriteria": [
        "A new \"Map\" button is visible next to the existing \"Flying\" button within each journey card in the Travelogue UI.",
        "The \"Map\" button includes a clearly visible \"2D\" logo/icon alongside the \"Map\" label.",
        "The existing \"Flying\" button remains present and in its original position relative to other Travelogue controls (no rearrangement)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TraveloguePanel.tsx",
          "operation": "modify",
          "description": "Within the Travelogue journey action buttons UI (the same area where the \"Flying\" button is rendered in the JourneyCard), add a new sibling \"Map\" button placed immediately adjacent to \"Flying\". Render a simple inline \"2D\" icon/mark (e.g., small text badge) inside the button next to the \"Map\" label. Use the existing shadcn-ui Button component styling conventions already used in this area. Verify the component's usage instructions before implementing. Ensure no changes are made to the doodle/scrapbook and retro itinerary views, and do not alter existing button order beyond inserting this new button next to \"Flying\"."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure the new \"Map\" button is non-functional and triggers no UI or data side effects when clicked.",
      "acceptanceCriteria": [
        "Clicking the \"Map\" button produces no visible UI change and triggers no side effects (no route changes, no dialogs, no toasts, no data fetching).",
        "No backend (Motoko) changes are introduced for this request."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TraveloguePanel.tsx",
          "operation": "modify",
          "description": "Implement the \"Map\" button click behavior as a strict no-op: do not wire navigation, do not update React state, do not invoke toasts, and do not call any hooks or backend capabilities. If an onClick is required by the existing pattern, provide an empty handler that performs no actions (and avoid any side effects). Keep all changes constrained to the Travelogue journey action buttons area only."
        }
      ]
    }
  ]
}